{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "batch_input_shape": [null, 28], "dtype": "float32", "target_shape": [1, 28]}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 48, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1.0000000116860974e-07, "amsgrad": false}}, "loss": "mse", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "bidirectional_4/forward_lstm_4/kernel", "shape": [28, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/kernel", "shape": [28, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_18/kernel", "shape": [512, 48], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [48], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [48, 256], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_23/kernel", "shape": [16, 3], "dtype": "float32"}, {"name": "dense_23/bias", "shape": [3], "dtype": "float32"}]}]}